tap "homebrew/bundle"
brew "bash"
brew "bat"
brew "fzf"
brew "git"
brew "gitleaks"
brew "htop"
brew "just"
brew "lazygit"
brew "neovim"
brew "nushell"
brew "pipx"
brew "pre-commit"
brew "starship"
brew "uv"
brew "wget"
brew "yazi"
brew "make"
cask "docker"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
