tap "azure/azd"
tap "azure/functions"
tap "databricks/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "modularml/packages"
tap "oven-sh/bun"
tap "supabase/tap"
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "azure-cli"
brew "bash"
brew "bat"
brew "c-blosc"
brew "gettext"
brew "lzo"
brew "cloudflared"
brew "eza"
brew "fd"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "gitleaks"
brew "grafana"
brew "hdf5"
brew "helix"
brew "helm"
brew "htop"
brew "icu4c@75"
brew "imagemagick"
brew "jq"
brew "just"
brew "kind"
brew "kubernetes-cli"
brew "kustomize"
brew "lazygit"
brew "neovim"
brew "node"
brew "nushell"
brew "openvino"
brew "pipx"
brew "poetry"
brew "poppler"
brew "portaudio"
brew "powerlevel10k"
brew "pre-commit"
brew "prometheus"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "ripgrep"
brew "sevenzip"
brew "starship"
brew "tmux"
brew "tpm"
brew "uv"
brew "wget"
brew "yazi"
brew "zig"
brew "zlib"
brew "zoxide"
brew "azure/azd/azd"
brew "azure/functions/azure-functions-core-tools@4"
brew "databricks/tap/databricks"
brew "hashicorp/tap/terraform"
brew "modularml/packages/modular"
brew "oven-sh/bun/bun"
brew "supabase/tap/supabase"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-cloud-sdk"
cask "quarto"
cask "warp"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "congyiwu.vscode-jupytext"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "grapecity.gc-excelviewer"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-hub"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "msazurermtools.azurerm-vscode-tools"
vscode "pkief.material-icon-theme"
vscode "randomfractalsinc.vscode-data-table"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "tamasfe.even-better-toml"
